----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Dropbox\Research\Data\Replication\Forsythe 2021\Replication_games\Logfiles/3_composition_labor_supply.log
  log type:  text
 opened on:  28 Jun 2023, 22:32:22

. 
. * options for regressions with fixed effects
. set matsize 2000

. set emptycells drop

. 
. **
. 
. * tables 5 and 6
. use Data/final_dataset, clear

. 
. ** 
. 
. * latex path for tables
. global table_path = "$latex_path\Tables"

. 
. **
. 
. * Table 5
. eststo  clear

. eststo: qui reg exp urate i.state i.date i.demographic if sample & d_hired==100 [w=weights], vce(cl state) cformat(%9.4f)
(est1 stored)

. eststo: qui reg exp urate i.state i.date i.demographic i.occ1990 i.ind1990 if sample & d_hired==100 [w=weights], vce(cl state) cformat(%9.4f)
(est2 stored)

. 
. * stata table
. esttab, keep(urate) se stats(r2 N) label varwidth(35) nonumbers nomtitles ///
> indicate("Occupation fixed effects = *.occ1990" "Industry fixed effects = *.ind1990")

-------------------------------------------------------------------
-------------------------------------------------------------------
U.\ rate                                   0.132**         0.113** 
                                        (0.0479)        (0.0409)   

Occupation fixed effects                      No             Yes   

Industry fixed effects                        No             Yes   
-------------------------------------------------------------------
r2                                        0.0686           0.182   
N                                         564107          564107   
-------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

.         
. * latex table
. esttab using "$table_path\table5.tex", keep(urate) se stats(r2 N, label("$ R^2 $")) label varwidth(35) nonumbers nomtitles ///
> indicate("Occupation fixed effects = *.occ1990" "Industry fixed effects = *.ind1990") replace /// 
> booktabs title("Average Potential Experience of Hires \label{table5}") 
(output written to D:\Dropbox\Applications\Overleaf\Forsythe (2021) - Replication\Tables\table5.tex)

. 
. **
. 
. * Table 6 
. 
. * Panel A: all individuals
. eststo  clear

. eststo: qui reg exp urate i.state i.date i.demographic [w=weights] if sample, vce(cluster state) cformat(%9.4f)
(est1 stored)

. eststo: qui reg exp urate i.state i.date i.demographic [w=weights] if sample & (L.empstat>=10 & L.empstat<=12), vce(cluster state) cformat(%9.4f)
(est2 stored)

. eststo: qui reg exp urate i.state i.date i.demographic [w=weights] if sample & (L.empstat>=21 & L.empstat<=22), vce(cluster state) cformat(%9.4f)
(est3 stored)

. eststo: qui reg exp urate i.state i.date i.demographic [w=weights] if sample & (L.empstat>=32 & L.empstat<=36), vce(cluster state) cformat(%9.4f)
(est4 stored)

. 
. * stata table 
. di "table 6 panel A"
table 6 panel A

. esttab, keep(urate) se r2 label nonumbers nomtitles

------------------------------------------------------------------------------------
------------------------------------------------------------------------------------
U.\ rate                  -0.0106          0.0364           0.184***       -0.138** 
                         (0.0283)        (0.0206)        (0.0522)        (0.0467)   
------------------------------------------------------------------------------------
Observations             16208583        10584758          630938         4992887   
R-squared                   0.045           0.040           0.064           0.083   
------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. * latex table
. esttab  using "$table_path\table6a.tex", keep(urate) se stats(r2 N) label varwidth(35) nonumbers nomtitles replace /// 
> booktabs title("Potential Experience within Cells (all) \label{table6a}") 
(output written to D:\Dropbox\Applications\Overleaf\Forsythe (2021) - Replication\Tables\table6a.tex)

. 
. * Panel B: new hires
. eststo  clear

. eststo: qui reg exp urate i.state i.date i.demographic [w=weights] if sample & d_hired==100, vce(cluster state) cformat(%9.4f)
(est1 stored)

. eststo: qui reg exp urate i.state i.date i.demographic [w=weights] if sample & d_hired==100 & (L.empstat>=10 & L.empstat<=12), vce(cluster state) cformat(%9.4f)
(est2 stored)

. eststo: qui reg exp urate i.state i.date i.demographic [w=weights] if sample & d_hired==100 & (L.empstat>=21 & L.empstat<=22), vce(cluster state) cformat(%9.4f)
(est3 stored)

. eststo: qui reg exp urate i.state i.date i.demographic [w=weights] if sample & d_hired==100 & (L.empstat>=32 & L.empstat<=36), vce(cluster state) cformat(%9.4f)
(est4 stored)

. 
. * Stata table
. di "table 6 panel B"
table 6 panel B

. esttab, keep(urate) se r2 label nonumbers nomtitles

------------------------------------------------------------------------------------
------------------------------------------------------------------------------------
U.\ rate                    0.132**         0.171***        0.249***       0.0243   
                         (0.0479)        (0.0455)        (0.0595)        (0.0961)   
------------------------------------------------------------------------------------
Observations               564107          211823          140188          212096   
R-squared                   0.069           0.058           0.062           0.110   
------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. * latex table
. esttab  using "$table_path\table6b.tex", keep(urate) se stats(r2 N, label("$ R^2 $")) label varwidth(35) nonumbers nomtitles replace /// 
> booktabs title("Potential Experience within Cells (new hires) \label{table6b}")
(output written to D:\Dropbox\Applications\Overleaf\Forsythe (2021) - Replication\Tables\table6b.tex)

. 
. **
. 
. * Panel C: Ratio
. * two differences with original paper: (1) experience variables (zero imputed to negative values) 
. * (2) no sample restrictions based on number of hires in all three categories.
. 
. * dummies for exp conditional on hiring
. gen exp_hired_all       = exp if d_hired == 100 // all
(29,115,956 missing values generated)

. gen exp_hired_emp       = exp if d_hired == 100 & (L.empstat>=10 & L.empstat<=12) // employed
(29,571,357 missing values generated)

. gen exp_hired_unemp = exp if d_hired == 100 & (L.empstat>=21 & L.empstat<=22) // unemployed
(29,662,141 missing values generated)

. gen exp_hired_nilf  = exp if d_hired == 100 & (L.empstat>=32 & L.empstat<=36) // nilf
(29,551,172 missing values generated)

. 
. * collapse to get average experience by cells
. collapse exp* urate [w=weights] if sample, by(date state)
(analytic weights assumed)

. gen ratio_all   = exp_hired_all / exp

. gen ratio_emp   = exp_hired_emp / exp
(3 missing values generated)

. gen ratio_unemp = exp_hired_unemp / exp
(15 missing values generated)

. gen ratio_nilf  = exp_hired_nilf / exp
(1 missing value generated)

. 
. * labels
. label var ratio_all

. 
. * regressions
. eststo  clear

. eststo: qui reg ratio_all urate i.state i.date, vce(cluster state) cformat(%9.4f)
(est1 stored)

. eststo: qui reg ratio_emp urate i.state i.date, vce(cluster state) cformat(%9.4f)
(est2 stored)

. eststo: qui reg ratio_unemp urate i.state i.date, vce(cluster state) cformat(%9.4f)
(est3 stored)

. eststo: qui reg ratio_nilf  urate i.state i.date, vce(cluster state) cformat(%9.4f)
(est4 stored)

. 
. * stata table 
. di "table 6 panel C"
table 6 panel C

. esttab, keep(urate) se r2 label nonumbers nomtitles

------------------------------------------------------------------------------------
------------------------------------------------------------------------------------
(mean) urate              0.00414*        0.00473         0.00839**       0.00215   
                        (0.00187)       (0.00276)       (0.00289)       (0.00326)   
------------------------------------------------------------------------------------
Observations                12036           12033           12021           12035   
R-squared                   0.262           0.160           0.111           0.147   
------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. * latex table
. esttab  using "$table_path\table6c.tex", keep(urate) se stats(r2 N, label("$ R^2 $")) label varwidth(35) nonumbers nomtitles replace /// 
> booktabs title("Potential Experience within Cells (ratio) \label{table6c}")
(output written to D:\Dropbox\Applications\Overleaf\Forsythe (2021) - Replication\Tables\table6c.tex)

. 
. **
. 
. log close
      name:  <unnamed>
       log:  D:\Dropbox\Research\Data\Replication\Forsythe 2021\Replication_games\Logfiles/3_composition_labor_supply.log
  log type:  text
 closed on:  28 Jun 2023, 22:51:58
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
